/*
2021年10月17日22:26:45
目的：理解一维数组
*/
# include<stdio.h>

int main(void)
{
	int a[3];
	int i;

	scanf_s("%d", &a[0]);
	printf("a[0] = %d\n", a[0]);

	scanf_s("%d", &a[2]);
	printf("a[2] = %d\n", a[2]);

	for (i = 0; i < 3; ++i)
		printf("%d\n", a[i]);

	return 0;
}
/*
在visio studio中输出结果为
-------------------------
1
a[0] = 1
5
a[2] = 5
1
-846121657454
5
-------------------------
总结：
1.定义一维数组：
	1）为n个变量连续分配存储空间
	2）所有变量类型必须相同
	3）所有变量所占字节大小相等
2.初始化
	1)完全初始化
		int a[5] = {1,2,3,4,5};
	2）不完全初始化，未被初始化的变量值为0
		int a [5] = {1,2,3};  //a[4] = 0,a[5] = 0
	3)不初始化，所有元素（变量）值为随机值
		int a[5];
	4)消零
		int a[5] = {0};
	错误写法：
		i）int a[5];
			a[5] = {1,2,3,4,5}；
			只有在定义数组的同时才可以为其赋值，其他情况皆为错误
		ii）int a[5] = {1,2,3,4,5};
			a[5] = 100;
			错误，没有a[5]这个元素，只有a[0]到a[4]
		iii)int a[5] = {1,2,3,4,5};
			int b[5];
			b = a;
			错误，a和b代表数组第一个元素的地址，不代表数组里面的元素
			若要将a[5]里面的元素赋给b[5],可以用for循环实现
			for(i = 0;i < 5;++i)
				b[i] = a[i];

*/